In [1]:
import pandas as pd
import numpy as np

In [2]:
# lectura de archivo y lo convierte en un DF
df_Flight = pd.read_csv(r"C:\Users\Usuario\Desktop\Ejercicios Modulo3\files/Customer Flight Activity.csv")
df_Loyalty = pd.read_csv(r"C:\Users\Usuario\Desktop\Ejercicios Modulo3\files/Customer Loyalty History.csv")

In [3]:
# unión mediante "Loyalty number" porque ambos contienen info de un mismo cliente(ID)
df_merge = df_Flight.merge(df_Loyalty, how = 'left', left_on = 'Loyalty Number', right_on = 'Loyalty Number')
df_merge.head()

df_final = df_merge.copy()

In [4]:
# resultado
df_final.columns

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed',
       'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [5]:
# PRIMER VISTAZO a los datos
df_final.head(10)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,...,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,...,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN
5,100301,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,70323.0,Divorced,Nova,48356.96,Standard,2013,9,NaN,NaN
6,100364,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,76849.0,Married,Nova,5143.88,Standard,2015,5,NaN,NaN
7,100380,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,69695.0,Single,Star,2465.62,Standard,2012,10,NaN,NaN
8,100428,2017,1,6,0,6,606,60.0,0,0,...,Bachelor,63478.0,Married,Aurora,5845.43,Standard,2012,8,NaN,NaN
9,100504,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,75638.0,Divorced,Nova,8807.61,Standard,2017,7,2018.0,3.0

In [6]:
df_final.tail(10)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
405614,999631,2018,12,11,1,12,2244,224.0,0,0,...,Bachelor,47349.0,Divorced,Star,2572.51,Standard,2014,1,NaN,NaN
405615,999891,2018,10,0,0,0,0,0.0,0,0,...,Bachelor,75616.0,Married,Nova,3745.37,Standard,2016,5,2017.0,1.0
405616,999758,2018,12,1,0,1,896,89.0,0,0,...,College,NaN,Single,Star,18690.34,Standard,2018,8,NaN,NaN
405617,999891,2018,11,0,0,0,0,0.0,0,0,...,Bachelor,75616.0,Married,Nova,3745.37,Standard,2016,5,2017.0,1.0
405618,999891,2018,12,0,0,0,0,0.0,0,0,...,Bachelor,75616.0,Married,Nova,3745.37,Standard,2016,5,2017.0,1.0
405619,999902,2018,12,0,0,0,0,0.0,0,0,...,College,NaN,Married,Aurora,7290.07,Standard,2014,5,NaN,NaN
405620,999911,2018,12,0,0,0,0,0.0,0,0,...,Doctor,217943.0,Single,Nova,8564.77,Standard,2012,8,NaN,NaN
405621,999940,2018,12,3,0,3,1233,123.0,0,0,...,Bachelor,47670.0,Married,Nova,20266.50,Standard,2017,7,NaN,NaN
405622,999982,2018,12,0,0,0,0,0.0,0,0,...,College,NaN,Married,Star,2631.56,Standard,2018,7,NaN,NaN
405623,999986,2018,12,0,0,0,0,0.0,0,0,...,Bachelor,46594.0,Married,Nova,8257.01,2018 Promotion,2018,2,NaN,NaN

In [7]:
# tamaño del DF [405.624 filas, 25 columnas]

df_final.shape

(405624, 25)

In [8]:
# columnas
df_final.columns

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed',
       'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [9]:
# información: nº filas, columnas, nulos y tipo de datos
df_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 25 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
 10  Country                      405624 non-null  object
 11  Province                     405624 non-null  object
 12  City                         405624 non-null  object
 13  Postal Code                  405624 non-null  object
 14  Gender                       405624 non-null  object
 15  Education                    405624 non-null  object
 16  Salary                       302952 non-null  float64
 17  Marital Status               405624 non-null  object
 18  Loyalty Card                 405624 non-null  object
 19  CLV                          405624 non-null  float64
 20  Enrollment Type              405624 non-null  object
 21  Enrollment Year              405624 non-null  int64
 22  Enrollment Month             405624 non-null  int64
 23  Cancellation Year            50064 non-null   float64
 24  Cancellation Month           50064 non-null   float64
dtypes: float64(5), int64(11), object(9)
memory usage: 77.4+ MB

In [10]:
# nº nulos por columna
df_final.isna().sum()

Loyalty Number                      0
Year                                0
Month                               0
Flights Booked                      0
Flights with Companions             0
Total Flights                       0
Distance                            0
Points Accumulated                  0
Points Redeemed                     0
Dollar Cost Points Redeemed         0
Country                             0
Province                            0
City                                0
Postal Code                         0
Gender                              0
Education                           0
Salary                         102672
Marital Status                      0
Loyalty Card                        0
CLV                                 0
Enrollment Type                     0
Enrollment Year                     0
Enrollment Month                    0
Cancellation Year              355560
Cancellation Month             355560
dtype: int64

In [11]:
# reemplazo los nulos por 0

columnas_imputadas = ["Salary", "Cancellation Year", "Cancellation Month"]

df_final[columnas_imputadas] = df_final[columnas_imputadas].fillna(0) # teemplaza NaN por 0

In [12]:
# confirmo que no hay nulos
df_final.isnull().any()

Loyalty Number                 False
Year                           False
Month                          False
Flights Booked                 False
Flights with Companions        False
Total Flights                  False
Distance                       False
Points Accumulated             False
Points Redeemed                False
Dollar Cost Points Redeemed    False
Country                        False
Province                       False
City                           False
Postal Code                    False
Gender                         False
Education                      False
Salary                         False
Marital Status                 False
Loyalty Card                   False
CLV                            False
Enrollment Type                False
Enrollment Year                False
Enrollment Month               False
Cancellation Year              False
Cancellation Month             False
dtype: bool

In [13]:
# nº filas duplicadas
df_final.duplicated().sum()

np.int64(1864)

In [14]:
# El DF presenta información agregada a nivel mensual por cliente, por lo que cada cliente aparece múltiples veces en función del año y mes
df_final["Loyalty Number"].duplicated().sum()

np.int64(388887)

In [15]:
# duplicados: hay 3936 filas donde el mismo cliente aparece en el mismo año y mes

df_final.duplicated(
    subset=["Loyalty Number", "Year", "Month"]
).sum()

np.int64(3936)

In [16]:
# eliminación de duplicados: mantengo la primera fila de cada cliente/año/mes
df_final = df_final.drop_duplicates(subset=["Loyalty Number", "Year", "Month"], keep='first')

In [17]:
# elimino la columna 'Province'
df_final.drop(columns=['Province'], errors='ignore', inplace = True) #si no existe, no hace nada 
df_final.columns

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed',
       'Country', 'City', 'Postal Code', 'Gender', 'Education', 'Salary',
       'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [18]:
# uno los valores de las columnas Year y Month para añadirlos a una nueva columna: Flights Date

df_final['Flights Date'] = pd.to_datetime(df_final[['Year', 'Month']].assign(Day=1))

# elimino las columnas Year y Month

df_final = df_final.drop(columns=['Year', 'Month'])

In [19]:
# idem
df_final['Enrollment Date'] = pd.to_datetime(df_final[['Enrollment Year', 'Enrollment Month']].rename(columns={
'Enrollment Year': 'Year','Enrollment Month': 'Month'}).assign(Day=1))

df_final = df_final.drop(columns=['Enrollment Year', 'Enrollment Month'])

In [20]:
# idem: para poder poner un formato fecha debo reemplazar los 0 por NaN

df_final[['Cancellation Year', 'Cancellation Month']] = df_final[['Cancellation Year', 'Cancellation Month']].replace(0, pd.NA)

df_final['Cancellation Date'] = pd.to_datetime(             # fecha, errors = 'coerce' convierte las filas con NaN en NaT
    df_final.assign(
        year=df_final['Cancellation Year'],
        month=df_final['Cancellation Month'],
        day=1
    )[["year","month","day"]],
    errors="coerce"
)

df_final = df_final.drop(columns=['Cancellation Year', 'Cancellation Month'])

In [21]:
# VERIFICAR la consistencia de los datos
# métricas

df_final = df_final[df_final['Flights Booked'] >= 0]
df_final = df_final[df_final['Total Flights'] >= 0]

df_final = df_final[df_final['Distance'] >= 0]


df_final = df_final[df_final['Points Accumulated'] >= 0]
df_final = df_final[df_final['Points Redeemed'] >= 0]


df_final = df_final[df_final['Salary'] >= 0]

# fecha correcta

df_final = df_final[df_final['Flights Date'] >=  '2000-01-01']
df_final = df_final[df_final['Enrollment Date'] >=  '2000-01-01']
df_final = df_final[df_final['Cancellation Date'] >=  '2000-01-01']

In [22]:
# tipo de datos: cambio Points Accumulated porque tiene sentido que sea int igual que Point Redeemed
df_final.info()

<class 'pandas.core.frame.DataFrame'>
Index: 49560 entries, 9 to 405618
Data columns (total 21 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Loyalty Number               49560 non-null  int64
 1   Flights Booked               49560 non-null  int64
 2   Flights with Companions      49560 non-null  int64
 3   Total Flights                49560 non-null  int64
 4   Distance                     49560 non-null  int64
 5   Points Accumulated           49560 non-null  float64
 6   Points Redeemed              49560 non-null  int64
 7   Dollar Cost Points Redeemed  49560 non-null  int64
 8   Country                      49560 non-null  object
 9   City                         49560 non-null  object
 10  Postal Code                  49560 non-null  object
 11  Gender                       49560 non-null  object
 12  Education                    49560 non-null  object
 13  Salary                       49560 non-null  float64
 14  Marital Status               49560 non-null  object
 15  Loyalty Card                 49560 non-null  object
 16  CLV                          49560 non-null  float64
 17  Enrollment Type              49560 non-null  object
 18  Flights Date                 49560 non-null  datetime64[ns]
 19  Enrollment Date              49560 non-null  datetime64[ns]
 20  Cancellation Date            49560 non-null  datetime64[ns]
dtypes: datetime64[ns](3), float64(3), int64(7), object(8)
memory usage: 8.3+ MB

In [23]:
# cambio Points Accumulated porque tiene sentido que sea int (igual que Point Redeemed)
df_final['Points Accumulated'] = df_final['Points Accumulated'].astype('int64')

In [ ]:
# FASE 2
# Análisis de variables numéricas:

variables_numericas = ['Flights Booked', 'Flights with Companions', 'Total Flights','Distance', 'Points Accumulated', 'Points Redeemed', 
'Dollar Cost Points Redeemed', 'Salary', 'CLV']

resultado = df_final[variables_numericas].agg(["mean", "median", "std", "var", "min", "max"])
print(resultado)

        Flights Booked  Flights with Companions  Total Flights       Distance  \
mean          1.232728                 0.307425       1.540153     354.678874
median        0.000000                 0.000000       0.000000       0.000000
std           3.434354                 1.229493       4.286192     946.653103
var          11.794784                 1.511654      18.371438  896152.097869
min           0.000000                 0.000000       0.000000       0.000000
max          21.000000                11.000000      31.000000    6262.000000

        Points Accumulated  Points Redeemed  Dollar Cost Points Redeemed  \
mean             36.317817         9.044996                     0.731941
median            0.000000         0.000000                     0.000000
std              96.946947        69.694125                     5.636625
var            9398.710609      4857.271084                    31.771542
min               0.000000         0.000000                     0.000000
max             636.000000       867.000000                    70.000000

              Salary           CLV
mean    5.911532e+04  8.129242e+03
median  6.367600e+04  5.793160e+03
std     4.564085e+04  7.246627e+03
var     2.083087e+09  5.251361e+07
min     0.000000e+00  1.898680e+03
max     3.553750e+05  8.332538e+04

In [ ]:
# valores atípicos (outliers) por variable

for i in variables_numericas:

    Q1 = df_final[i].quantile(0.25)
    Q3 = df_final[i].quantile(0.75)
    IQR = Q3 - Q1
    outliers = df_final[(df_final[i] < Q1 - 1.5*IQR) | (df_final[i] > Q3 + 1.5*IQR)]
    print(f"{i}: {len(outliers)} outliers")

Flights Booked: 7520 outliers
Flights with Companions: 3934 outliers
Total Flights: 7520 outliers
Distance: 7520 outliers
Points Accumulated: 7520 outliers
Points Redeemed: 869 outliers
Dollar Cost Points Redeemed: 869 outliers
Salary: 840 outliers
CLV: 4776 outliers

In [ ]:
# correlación entre variables numéricas: que tan relacionadas están 2 variables numéricas 
# Ejemplo: Distance + Points accumulated --> cuanto más viaje más puntos acumula

correlacion = df_final[variables_numericas].corr()
print(correlacion)

                             Flights Booked  Flights with Companions  \
Flights Booked                     1.000000                 0.599761
Flights with Companions            0.599761                 1.000000
Total Flights                      0.973301                 0.767414
Distance                           0.842654                 0.616807
Points Accumulated                 0.837362                 0.610808
Points Redeemed                    0.254243                 0.379452
Dollar Cost Points Redeemed        0.254315                 0.379478
Salary                            -0.006328                -0.012899
CLV                               -0.025453                -0.021712

                             Total Flights  Distance  Points Accumulated  \
Flights Booked                    0.973301  0.842654            0.837362
Flights with Companions           0.767414  0.616807            0.610808
Total Flights                     1.000000  0.852115            0.846155
Distance                          0.852115  1.000000            0.996143
Points Accumulated                0.846155  0.996143            1.000000
Points Redeemed                   0.312560  0.294443            0.293578
Dollar Cost Points Redeemed       0.312626  0.294560            0.293697
Salary                           -0.008770 -0.005011           -0.005661
CLV                              -0.026623 -0.025057           -0.023791

                             Points Redeemed  Dollar Cost Points Redeemed  \
Flights Booked                      0.254243                     0.254315
Flights with Companions             0.379452                     0.379478
Total Flights                       0.312560                     0.312626
Distance                            0.294443                     0.294560
Points Accumulated                  0.293578                     0.293697
Points Redeemed                     1.000000                     0.999974
Dollar Cost Points Redeemed         0.999974                     1.000000
Salary                             -0.004737                    -0.004765
CLV                                -0.009760                    -0.009784

                               Salary       CLV
Flights Booked              -0.006328 -0.025453
Flights with Companions     -0.012899 -0.021712
Total Flights               -0.008770 -0.026623
Distance                    -0.005011 -0.025057
Points Accumulated          -0.005661 -0.023791
Points Redeemed             -0.004737 -0.009760
Dollar Cost Points Redeemed -0.004765 -0.009784
Salary                       1.000000  0.024558
CLV                          0.024558  1.000000

In [29]:
# Análisis de variables categóricas:

variables_categoricas = ["Gender", "Education", "Marital Status", "Loyalty Card", "Enrollment Type"]

for i in variables_categoricas:
    print(i)
    
    # nº clientes por categoría 
    print(df_final[i].value_counts())    
    
    # % clientes por categoría
    print(df_final[i].value_counts(normalize=True).mul(100).round(2))

Gender
Gender
Female    25296
Male      24264
Name: count, dtype: int64
Gender
Female    51.04
Male      48.96
Name: proportion, dtype: float64
Education
Education
Bachelor                30816
College                 12648
Doctor                   2304
High School or Below     2232
Master                   1560
Name: count, dtype: int64
Education
Bachelor                62.18
College                 25.52
Doctor                   4.65
High School or Below     4.50
Master                   3.15
Name: proportion, dtype: float64
Marital Status
Marital Status
Married     29112
Single      13464
Divorced     6984
Name: count, dtype: int64
Marital Status
Married     58.74
Single      27.17
Divorced    14.09
Name: proportion, dtype: float64
Loyalty Card
Loyalty Card
Star      21600
Nova      17208
Aurora    10752
Name: count, dtype: int64
Loyalty Card
Star      43.58
Nova      34.72
Aurora    21.69
Name: proportion, dtype: float64
Enrollment Type
Enrollment Type
Standard          46848
2018 Promotion     2712
Name: count, dtype: int64
Enrollment Type
Standard          94.53
2018 Promotion     5.47
Name: proportion, dtype: float64